// **********************************************
// 제 목 : C++ CH 1-1 과제 제출
// 날 짜 :  2026년 03월 04일
// 작성자 : 2201053 최종화
// **********************************************

// 실습과제 1
// 02 알고리즘이 설계가 더 중요하다고 생각하고, 알고리즘 설계를 잘하면 코딩하는 방법은 쉽기 때문입니다.
// 03 클래스는 C언어의 구조체와 비슷하며 정해진 자료형이 아닌 새로운 자료형, 함수를 제가 알기 편하게 만드는 것이고, 객체는 클래스를 통해서 나온 결과물입니다.
// 04 절자지향 프로그래밍 언어는 함수 중심, 객체지향 프로그래밍 언어는 객체 중심입니다.
// 05 라이브러리는 자주쓰는 기능(함수,변수,클래스)를 모아놓은 코드입니다.
// 06 이미 검증된 것들이기에 컴파일하지 않아도 되어서 바로 링크 과정으로 넘어가도 되기 때문입니다.
// 07 제가 만든 소스코드를 컴파일해서 나온 목적파일과 라이브러리(목적파일)을 합쳐서 하나의 실행파일로 만드는 과정이기 때문이다.
